In [1]:
import pandas as pd
import numpy as np

In [10]:
arry1=np.ndarray([1,2,3,4,5,6])
# np.ndarray is a class call
arry2=np.array([1,2,3,4,5,6])
# np.array is a method call for class ndarray
arry3=np.array([[1,2,3,4,5,6],[7,8,9,11,12,13]])
print(arry1.ndim)
print(arry1.shape)

print(arry2.ndim)
print(arry2.shape)

6
(1, 2, 3, 4, 5, 6)
1
(6,)

In [12]:
pd.DataFrame(arry3,columns=['a','b','c','d','e','f'])

pd.DataFrame(arry2,columns=['a'])

   a
0  1
1  2
2  3
3  4
4  5
5  6

In [14]:
dic=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
table= pd.DataFrame(dic,index=['first','Second'])
print(table)

        a  b    c
first   1  2  NaN
Second  3  4  5.0

In [21]:
d1=pd.Series([1,2,3],index=['a','b','c'])
d2=pd.Series([4,5,6],index=['a','b','c'])
df=pd.DataFrame({'alpha':d1,'beta':d2})

df["b":"c"]
df[0:2]
df[]

   alpha  beta
a      1     4
b      2     5

In [22]:
df=pd.DataFrame([[1,2,3],[4,5,6]],index=['a','b'],columns=['alpha','beta','gamma'])
print(df)

df1=pd.DataFrame([[7,8,9],[10,11,12]],index=['c','d'],columns=['alpha','beta','gamma'])

df3=df.append(df1)
df3

   alpha  beta  gamma
a      1     2      3
b      4     5      6

   alpha  beta  gamma
a      1     2      3
b      4     5      6
c      7     8      9
d     10    11     12

In [87]:
df3.loc["a":"c","alpha"]
df3.loc[["a","c"],"alpha"]
df3.loc[["a","c"],"alpha":"gamma"]

   alpha  beta  gamma
a      1     2      3
c      7     8      9

In [92]:
df3.iloc[:,1:3]
df3.iloc[[0,2],1:3]

   beta  gamma
a     2      3
c     8      9

In [17]:
df3.loc['a']
type(df3.loc['a'])
# df3.loc["a"]["alpha"]

pandas.core.series.Series

In [53]:
df3.iloc[0]
type(df3.iloc[0])
df3.iloc[0]["alpha"]=5
df3["alpha"]["a"]=4
df3

C:\Users\akhil\anaconda3\envs\spark\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

   alpha  beta  gamma
a    4.0     2      3
b    4.0     5      6
c    7.0     8      9
d   10.0    11     12

In [50]:
df=pd.DataFrame(np.random.rand(5,4),columns=['col1','col2','col3','col4'])
for  row in df.itertuples():
    print(row)
    
df

Pandas(Index=0, col1=0.25616373197512143, col2=0.14874131773693644, col3=0.45927006771075574, col4=0.17999286837323047)
Pandas(Index=1, col1=0.6177689964655864, col2=0.10406597576783638, col3=0.8118728855863407, col4=0.03647840159133142)
Pandas(Index=2, col1=0.9112273869581456, col2=0.9562918762950872, col3=0.8078120837388105, col4=0.8415996870640963)
Pandas(Index=3, col1=0.26122745464720887, col2=0.2929042633121185, col3=0.8530869377716008, col4=0.6334792784124618)
Pandas(Index=4, col1=0.9132971130544322, col2=0.9860985810628167, col3=0.3673016499431565, col4=0.9897001396386996)

       col1      col2      col3      col4
0  0.256164  0.148741  0.459270  0.179993
1  0.617769  0.104066  0.811873  0.036478
2  0.911227  0.956292  0.807812  0.841600
3  0.261227  0.292904  0.853087  0.633479
4  0.913297  0.986099  0.367302  0.989700

In [80]:
world_cup={'Team':['West Indies','West Indies','India','Australia','Pakistan','Sri Lanka','Australia','Australia','Australia','India','Australia'],'Rank':[7,7,2,1,6,4,1,1,1,2,9],'Year':[1975,1979,1983,1987,1992,1996,1999,2003,2007,2011,2015]}   
df=pd.DataFrame(world_cup)
print(df)

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     9  2015

In [81]:
grouped=df.groupby(['Team','Rank'])
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [83]:
for key,value in grouped:
    print(key)
    print()
    print(value.Year)
    print()

('Australia', 1)

3    1987
6    1999
7    2003
8    2007
Name: Year, dtype: int64

('Australia', 9)

10    2015
Name: Year, dtype: int64

('India', 2)

2    1983
9    2011
Name: Year, dtype: int64

('Pakistan', 6)

4    1992
Name: Year, dtype: int64

('Sri Lanka', 4)

5    1996
Name: Year, dtype: int64

('West Indies', 7)

0    1975
1    1979
Name: Year, dtype: int64

In [2]:
champion_stats={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
                'ICC_rank':[2,3,7,8,4],
               'World_champions_Year':[2011,2015,1979,1992,1996],
               'Points':[874,787,753,673,855]}

match_stats={'Team':['Australia','India','West Indies','Pakistan','Sri Lanka'],
            'World_cup_played':[11,10,11,9,8],
            'ODis_played':[733,988,712,679,662]}

df1=pd.DataFrame(champion_stats)
df2=pd.DataFrame(match_stats)
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

TypeError: '(slice(0, 2, None), 2)' is an invalid key

In [91]:
pd.merge(df1,df2, on='Team')

,Team,ICC_rank,World_champions_Year,Points,World_cup_played,ODis_played
0,India,2,2011,874,10,988
1,Australia,3,2015,787,11,733
2,West Indies,7,1979,753,11,712
3,Pakistan,8,1992,673,9,679
4,Sri Lanka,4,1996,855,8,662

In [92]:
df2.merge(df1, on='Team')

,Team,World_cup_played,ODis_played,ICC_rank,World_champions_Year,Points
0,Australia,11,733,3,2015,787
1,India,10,988,2,2011,874
2,West Indies,11,712,7,1979,753
3,Pakistan,9,679,8,1992,673
4,Sri Lanka,8,662,4,1996,855

In [5]:
pd.concat([df1,df2],axis=1)
# concat join two dataframe on index of two dataframe when axis=1

,Team,ICC_rank,World_champions_Year,Points,Team,World_cup_played,ODis_played
0,India,2,2011,874,Australia,11,733
1,Australia,3,2015,787,India,10,988
2,West Indies,7,1979,753,West Indies,11,712
3,Pakistan,8,1992,673,Pakistan,9,679
4,Sri Lanka,4,1996,855,Sri Lanka,8,662

In [95]:
pd.concat([df1,df2],axis=0)

# concat join two dataframe on column name of two dataframe when axis=0

C:\ProgramData\Anaconda3\envs\Tensor\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,ICC_rank,ODis_played,Points,Team,World_champions_Year,World_cup_played
0,2.0,NaN,874.0,India,2011.0,NaN
1,3.0,NaN,787.0,Australia,2015.0,NaN
2,7.0,NaN,753.0,West Indies,1979.0,NaN
3,8.0,NaN,673.0,Pakistan,1992.0,NaN
4,4.0,NaN,855.0,Sri Lanka,1996.0,NaN
0,NaN,733.0,NaN,Australia,NaN,11.0
1,NaN,988.0,NaN,India,NaN,10.0
2,NaN,712.0,NaN,West Indies,NaN,11.0
3,NaN,679.0,NaN,Pakistan,NaN,9.0
4,NaN,662.0,NaN,Sri Lanka,NaN,8.0

In [20]:
df

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     1  2015

In [24]:

for key, value in df.iteritems():
    print(key,value[2])

Team India
Rank 2
Year 1983

In [28]:
for key, value in df.iterrows():
    print(key,value)

0 Team    West Indies
Rank              7
Year           1975
Name: 0, dtype: object
1 Team    West Indies
Rank              7
Year           1979
Name: 1, dtype: object
2 Team    India
Rank        2
Year     1983
Name: 2, dtype: object
3 Team    Australia
Rank            1
Year         1987
Name: 3, dtype: object
4 Team    Pakistan
Rank           6
Year        1992
Name: 4, dtype: object
5 Team    Sri Lanka
Rank            4
Year         1996
Name: 5, dtype: object
6 Team    Australia
Rank            1
Year         1999
Name: 6, dtype: object
7 Team    Australia
Rank            1
Year         2003
Name: 7, dtype: object
8 Team    Australia
Rank            1
Year         2007
Name: 8, dtype: object
9 Team    India
Rank        2
Year     2011
Name: 9, dtype: object
10 Team    Australia
Rank            1
Year         2015
Name: 10, dtype: object

In [37]:
for tup in df.iterrows():
    print(tup[1].Team)

West Indies
West Indies
India
Australia
Pakistan
Sri Lanka
Australia
Australia
Australia
India
Australia

In [96]:
print(df1.Team.values)

0          India
1      Australia
2    West Indies
3       Pakistan
4      Sri Lanka
Name: Team, dtype: object

In [37]:
df1[ (df1["Points"]>700) &  (df1["World_champions_Year"]>2000)]

        Team  ICC_rank  World_champions_Year  Points
0      India         2                  2011     874
1  Australia         3                  2015     787

In [64]:
df3.index=["akhil","nikhil","archie","prachi"]

In [66]:
len(df3.index)

4

In [76]:
df1.iloc[:,1:3]

   ICC_rank  World_champions_Year
0         2                  2011
1         3                  2015
2         7                  1979
3         8                  1992
4         4                  1996

In [13]:
dfwoindex=pd.DataFrame(np.arange(0,12).reshape([3,4]))
dfwoindex

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [14]:
dfwoindex[0]

0    0
1    4
2    8
Name: 0, dtype: int32

In [18]:
df1.iloc[0]

Team                    India
ICC_rank                    2
World_champions_Year     2011
Points                    874
Name: 0, dtype: object

In [19]:
df1[0:3]

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753

In [25]:
df1.stack()

0  Team                          India
   ICC_rank                          2
   World_champions_Year           2011
   Points                          874
1  Team                      Australia
   ICC_rank                          3
   World_champions_Year           2015
   Points                          787
2  Team                    West Indies
   ICC_rank                          7
   World_champions_Year           1979
   Points                          753
3  Team                       Pakistan
   ICC_rank                          8
   World_champions_Year           1992
   Points                          673
4  Team                      Sri Lanka
   ICC_rank                          4
   World_champions_Year           1996
   Points                          855
dtype: object

In [26]:
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [27]:
a = np.arange(10)


np.where(a < 55, a, 10*a)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [42]:
pd.value_counts(df1.ICC_rank>3)[True]

3

In [49]:
df

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     1  2015

In [55]:
df[["Team","Rank"]].groupby(["Team"]).mean()

             Rank
Team
Australia       1
India           2
Pakistan        6
Sri Lanka       4
West Indies     7

In [56]:
df

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     1  2015

In [62]:
pd.isnull(df).sum()

Team    0
Rank    0
Year    0
dtype: int64

In [3]:
ww2=pd.Series([870000,440000,300000,210000,40000],index=('ussr','germany','chine','japan','usa'))
ww2df=pd.DataFrame({"countries":ww2})

In [33]:
df1.loc[0:1,"ICC_rank":"Points"]

   ICC_rank  World_champions_Year  Points
0         2                  2011     874
1         3                  2015     787

In [47]:
df1[1:3]

            C1  C2    C3   C4
1    Australia   3  2015  787
2  West Indies   7  1979  753

In [39]:
newColumns=(['C1','C2','C3','C4'])

In [40]:
df1.columns=newColumns
df1

            C1  C2    C3   C4
0        India   2  2011  874
1    Australia   3  2015  787
2  West Indies   7  1979  753
3     Pakistan   8  1992  673
4    Sri Lanka   4  1996  855

In [44]:
df1[["C1","C3"]]
df1.loc[:,["C1","C3"]]

            C1    C3
0        India  2011
1    Australia  2015
2  West Indies  1979
3     Pakistan  1992
4    Sri Lanka  1996

In [51]:
df1["C1"][0]
df1.iloc[0,0]="Sweden"
df1

            C1  C2    C3   C4
0       Sweden   2  2011  874
1    Australia   3  2015  787
2  West Indies   7  1979  753
3     Pakistan   8  1992  673
4    Sri Lanka   4  1996  855

In [56]:
df1.drop(columns="C4",axis=1)

            C1  C2    C3
0       Sweden   2  2011
1    Australia   3  2015
2  West Indies   7  1979
3     Pakistan   8  1992
4    Sri Lanka   4  1996

In [58]:
nandf=pd.DataFrame([[1,2,3],[4,np.nan,5],[np.nan,8,np.nan]])

TypeError: _nansum_dispatcher() missing 1 required positional argument: 'a'

In [61]:
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [62]:
df2

          Team  World_cup_played  ODis_played
0    Australia                11          733
1        India                10          988
2  West Indies                11          712
3     Pakistan                 9          679
4    Sri Lanka                 8          662

In [69]:
pd.merge(df1,df2,left_on="Team",right_on="Team")

,Team,ICC_rank,World_champions_Year,Points,World_cup_played,ODis_played
0,India,2,2011,874,10,988
1,Australia,3,2015,787,11,733
2,West Indies,7,1979,753,11,712
3,Pakistan,8,1992,673,9,679
4,Sri Lanka,4,1996,855,8,662

In [64]:
left = pd.DataFrame({'key1': ['foo', 'bar'], 'lval': [1, 2]})

right = pd.DataFrame({'key2': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, left_on='key1', right_on='key2')

  key1  lval key2  rval
0  foo     1  foo     4
1  bar     2  bar     5

In [74]:
df1.join(df2,on=["Team"])

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat